RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_usb.c
    tmpVal = BL_RD_REG(USB_BASE, USB_PHY_TST);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_UNPLUG);
    BL_WR_REG(USB_BASE, USB_PHY_TST, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB SOF mask timer in full speed
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_SoftDetach_Disable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_PHY_TST);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_UNPLUG);
    BL_WR_REG(USB_BASE, USB_PHY_TST, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  is USB FIFOn empty
 *
 * @param  fifoNum: FIFO number
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Is_FIFO_Empty(USB_FIFO_EMPTY_Type fifoNum)
{
    CHECK_PARAM(IS_USB_FIFO_EMPTY_TYPE(fifoNum));

    return (BL_RD_REG(USB_BASE, USB_DEV_CXCFE) & (1 << fifoNum)) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  is USB control FIFO empty
 *
 * @param  None
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Is_CTRL_FIFO_Empty(void)
{
    return BL_GET_REG_BITS_VAL(BL_RD_REG(USB_BASE, USB_DEV_CXCFE), USB_CX_EMP) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  is USB control FIFO full
 *
 * @param  None
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Is_CTRL_FIFO_Full(void)
{
    return BL_GET_REG_BITS_VAL(BL_RD_REG(USB_BASE, USB_DEV_CXCFE), USB_CX_FUL) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  is USB control FIFO full
 *
 * @param  None
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Err_Type USB_Clear_CTRL_FIFO(void)
{
    BL_WR_REG(USB_BASE, USB_DEV_CXCFE, BL_SET_REG_BIT(0, USB_CX_CLR));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB control endpoint stall once
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_CTRL_Endpoint_Stall_Once(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CXCFE);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CX_STL);
    BL_WR_REG(USB_BASE, USB_DEV_CXCFE, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB control endpoint data transfer done
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_CTRL_Endpoint_Data_Transfer_Done(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CXCFE);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_CX_DONE);
    BL_WR_REG(USB_BASE, USB_DEV_CXCFE, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  is USB endpoint receive 0 length data packet
 *
 * @param  epID: endpoint number
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Is_Endpoint_Receive_Zero_Length_Packet(USB_Endpoint_Type epID)
{
    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    return (BL_RD_REG(USB_BASE, USB_DEV_RXZ) & (1 << (epID - 1))) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  clear USB endpoint receive 0 length data packet
 *
 * @param  epID: endpoint number
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Clear_Endpoint_Receive_Zero_Length_Packet_Status(USB_Endpoint_Type epID)
{
    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    BL_WR_REG(USB_BASE, USB_DEV_RXZ, 1 << (epID - 1));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  reset USB in endpoint data_toggle_sequence
 *
 * @param  epID: endpoint number
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Reset_Endpoint_IN_Data_Toggle_Sequence(USB_Endpoint_Type epID)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    /* calc reg address */
    regAddr = USB_BASE + USB_DEV_INMPS1_OFFSET + (epID - 1) * 4;

    /* clear RSTG_IEPn bit */
    BL_RD_WORD(regAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_RSTG_IEP1);
    BL_WR_WORD(regAddr, tmpVal);

    /* set RSTG_IEPn bit */
    BL_RD_WORD(regAddr);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_RSTG_IEP1);
    BL_WR_WORD(regAddr, tmpVal);

    /* clear RSTG_IEPn bit */
    BL_RD_WORD(regAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_RSTG_IEP1);
    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  reset USB out endpoint data_toggle_sequence
 *
 * @param  epID: endpoint number
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Reset_Endpoint_OUT_Data_Toggle_Sequence(USB_Endpoint_Type epID)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    /* calc reg address */
    regAddr = USB_BASE + USB_DEV_OUTMPS1_OFFSET + (epID - 1) * 4;

    /* clear RSTG_IEPn bit */
    BL_RD_WORD(regAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_RSTG_OEP1);
    BL_WR_WORD(regAddr, tmpVal);

    /* set RSTG_IEPn bit */
    BL_RD_WORD(regAddr);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_RSTG_OEP1);
    BL_WR_WORD(regAddr, tmpVal);

    /* clear RSTG_IEPn bit */
    BL_RD_WORD(regAddr);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_RSTG_OEP1);
    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB endpoint transmit 0 length data packet
 *
 * @param  epID: endpoint number
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Endpoint_Transmit_Zero_Length_Packet(USB_Endpoint_Type epID)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    regAddr = USB_BASE + USB_DEV_INMPS1_OFFSET + 0x04 * (epID - 1);

    tmpVal = BL_RD_WORD(regAddr);
    tmpVal |= (1 << USB_TX0BYTE_IEP1_POS);
    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  is USB endpoint receive 0 length data packet
 *
 * @param  epID: endpoint number
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Is_Endpoint_Transfer_Zero_Length_Packet(USB_Endpoint_Type epID)
{
    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    return (BL_RD_REG(USB_BASE, USB_DEV_TXZ) & (1 << (epID - 1))) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  clear USB endpoint transfer 0 length data packet status
 *
 * @param  epID: endpoint number
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Clear_Endpoint_Transfer_Zero_Length_Packet_Status(USB_Endpoint_Type epID)
{
    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    BL_WR_REG(USB_BASE, USB_DEV_TXZ, 1 << (epID - 1));

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB IN endpoint stall
 *
 * @param  epID: endpoint number
 * @param  enable: ENABLE or DISABLE
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_Endpoint_IN_Stall(USB_Endpoint_Type epID, uint8_t enable)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

    regAddr = USB_BASE + USB_DEV_INMPS1_OFFSET + 0x04 * (epID - 1);

    tmpVal = BL_RD_WORD(regAddr);

    if (enable) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_STL_IEP1);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_STL_IEP1);
    }

    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB IN endpoint max packet size
 *
 * @param  epID: endpoint number
 * @param  max: max packet size
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_Endpoint_IN_MaxPacketSize(USB_Endpoint_Type epID, uint16_t max)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));
    CHECK_PARAM((max <= 0x7FF));

    regAddr = USB_BASE + USB_DEV_INMPS1_OFFSET + 0x04 * (epID - 1);

    tmpVal = BL_RD_WORD(regAddr);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_MAXPS_IEP1, max);
    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB OUT endpoint stall
 *
 * @param  epID: endpoint number
 * @param  enable: ENABLE or DISABLE
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_Endpoint_OUT_Stall(USB_Endpoint_Type epID, uint8_t enable)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    /* cannot be USB_Endpoint_0 */
    CHECK_PARAM(IS_USB_ENDPOINT_TYPE(epID));

