RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_usb.c
        case USB_FIFO_3:
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_DIR_FIFO3, cfg->dir);
            tmpVal1 = BL_SET_REG_BITS_VAL(tmpVal1, USB_EPNO_FIFO3, cfg->epID);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_EN_F3, en);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKSZ_F3, cfg->blockSize);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLKNO_F3, cfg->blockType);
            tmpVal2 = BL_SET_REG_BITS_VAL(tmpVal2, USB_BLK_TYP_F3, cfg->fifoType);
            break;

        default:
            break;
    }

    BL_WR_REG(USB_BASE, USB_DEV_FMAP, tmpVal1);
    BL_WR_REG(USB_BASE, USB_DEV_FCFG, tmpVal2);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  reset USB FIFO
 *
 * @param  fifoID: FIFO ID
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Reset_FIFO(USB_FIFO_Type fifoID)
{
    uint32_t tmpVal = 0;
    uint32_t regAddr = 0;

    CHECK_PARAM(IS_USB_FIFO_TYPE(fifoID));

    regAddr = USB_BASE + USB_DEV_FIBC0_OFFSET + 0x04 * fifoID;

    tmpVal = BL_RD_WORD(regAddr);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_FFRST0_HOV);
    BL_WR_WORD(regAddr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB out FIFO count
 *
 * @param  fifoID: FIFO ID
 *
 * @return FIFO count
 *
*******************************************************************************/
uint16_t USB_Get_OUT_FIFO_Count(USB_FIFO_Type fifoID)
{
    uint32_t regAddr = 0;

    CHECK_PARAM(IS_USB_FIFO_TYPE(fifoID));

    regAddr = USB_BASE + USB_DEV_FIBC0_OFFSET + 0x04 * fifoID;

    return BL_GET_REG_BITS_VAL(BL_RD_WORD(regAddr), USB_BC_F0);
}

/****************************************************************************/ /**
 * @brief  set USB dma configuration
 *
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_DMA_Config(USB_DMA_TARGET_FIFO_Type fifoN, USB_DMA_Cfg_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_USB_DMA_TRANS_DIR_TYPE(cfg->dir));
    CHECK_PARAM(IS_USB_DMA_TARGET_FIFO_TYPE(fifoN));
    CHECK_PARAM(((cfg->length) <= 0x1FFFF));

    switch (fifoN) {
        case USB_DMA_TARGET_FIFO_CTRL:
            tmpVal = (1 << 4);
            break;
        case USB_DMA_TARGET_FIFO_0:
            tmpVal = (1 << 0);
            break;
        case USB_DMA_TARGET_FIFO_1:
            tmpVal = (1 << 1);
            break;
        case USB_DMA_TARGET_FIFO_2:
            tmpVal = (1 << 2);
            break;
        case USB_DMA_TARGET_FIFO_3:
            tmpVal = (1 << 3);
            break;
        default:
            break;
    }
    BL_WR_REG(USB_BASE, USB_DMA_TFN, tmpVal);

    tmpVal = BL_RD_REG(USB_BASE, USB_DMA_CPS1);

    switch (cfg->dir) {
        case USB_DMA_TRANS_DIR_FIFO_2_MEM:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_IO_HOV, 0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_TYPE_HOV, 0);
            break;

        case USB_DMA_TRANS_DIR_MEM_2_FIFO:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_IO_HOV, 0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_TYPE_HOV, 1);
            break;

        case USB_DMA_TRANS_DIR_FIFO_2_FIFO:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_IO_HOV, 1);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_TYPE_HOV, 0);

            if ((cfg->length) & 0x3) {
                return ERROR;
            }

            break;

        default:
            break;
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_LEN_HOV, cfg->length);
    BL_WR_REG(USB_BASE, USB_DMA_CPS1, tmpVal);

    BL_WR_REG(USB_BASE, USB_DMA_CPS2, cfg->memAddr);

    return SUCCESS;
}
/****************************************************************************/ /**
 * @brief  reset usb dma accessing fifo
 *
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
void USB_Reset_DMA_Accessing_Fifo(void)
{
    BL_WR_REG(USB_BASE, USB_DMA_TFN, 0);
}
/****************************************************************************/ /**
 * @brief  update USB dma transmit configuration
 *
 * @param  memAddr: memory address
 * @param  length: transmit length
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Update_DMA_Trans(uint32_t memAddr, uint32_t length)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DMA_CPS1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_DMA_LEN_HOV, length);
    BL_WR_REG(USB_BASE, USB_DMA_CPS1, tmpVal);

    BL_WR_REG(USB_BASE, USB_DMA_CPS2, memAddr);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB dma transmit start
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_DMA_Start(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_DMA_CPS1);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_DMA_START_HOV);
    BL_WR_REG(USB_BASE, USB_DMA_CPS1, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB setup command
 *
 * @param  setup[2]: buffer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Get_Setup_Command(uint32_t setup[2])
{
    uint32_t tmpVal = 0;

    if (NULL == setup) {
        return ERROR;
    }

    tmpVal = BL_RD_REG(USB_BASE, USB_DMA_TFN);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_ACC_CXF_HOV);
    BL_WR_REG(USB_BASE, USB_DMA_TFN, tmpVal);

    setup[0] = BL_RD_REG(USB_BASE, USB_DMA_CPS3);
    setup[1] = BL_RD_REG(USB_BASE, USB_DMA_CPS3);

    tmpVal = BL_RD_REG(USB_BASE, USB_DMA_TFN);
    tmpVal = BL_CLR_REG_BIT(tmpVal, USB_ACC_CXF_HOV);
    BL_WR_REG(USB_BASE, USB_DMA_TFN, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB vdma configuration
 *
 * @param  fifoN: target FIFO
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_VDMA_Config(USB_VDMA_TARGET_FIFO_Type fifoN, USB_VDMA_Cfg_Type *cfg)
{
    uint32_t tmpVal = 0;
    uint32_t setting1Addr = 0;
    uint32_t setting2Addr = 0;

    CHECK_PARAM(IS_USB_VDMA_TARGET_FIFO_TYPE(fifoN));
    CHECK_PARAM(IS_USB_VDMA_TRANS_DIR_TYPE(cfg->dir));
    CHECK_PARAM(((cfg->length) <= 0x1FFFF));

    setting1Addr = USB_BASE + USB_VDMA_CXFPS1_OFFSET + 0x08 * (fifoN);
    setting2Addr = USB_BASE + USB_VDMA_CXFPS2_OFFSET + 0x08 * (fifoN);
    tmpVal = BL_RD_WORD(setting1Addr);

    switch (cfg->dir) {
        case USB_VDMA_TRANS_DIR_FIFO_2_MEM:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_VDMA_IO_CXF, 0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_VDMA_TYPE_CXF, 0);
            break;

