RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_usb.c
        case USB_VDMA_TRANS_DIR_MEM_2_FIFO:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_VDMA_IO_CXF, 0);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_VDMA_TYPE_CXF, 1);
            break;

        case USB_VDMA_TRANS_DIR_FIFO_2_FIFO:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_VDMA_IO_CXF, 1);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_VDMA_TYPE_CXF, 0);

            if ((cfg->length) & 0x3) {
                return ERROR;
            }

            break;

        default:
            break;
    }

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_VDMA_LEN_CXF, cfg->length);
    BL_WR_WORD(setting1Addr, tmpVal);

    BL_WR_WORD(setting2Addr, cfg->memAddr);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB vdma transmit start
 *
 * @param  fifoN: target FIFO
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_VDMA_Start(USB_VDMA_TARGET_FIFO_Type fifoN)
{
    uint32_t tmpVal = 0;
    uint32_t setting1Addr = 0;

    CHECK_PARAM(IS_USB_VDMA_TARGET_FIFO_TYPE(fifoN));

    setting1Addr = USB_BASE + USB_VDMA_CXFPS1_OFFSET + 0x08 * (fifoN);

    tmpVal = BL_RD_WORD(setting1Addr);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_VDMA_START_CXF);
    BL_WR_WORD(setting1Addr, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB vdma transmit start status
 *
 * @param  fifoN: target FIFO
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Get_VDMA_Start(USB_VDMA_TARGET_FIFO_Type fifoN)
{
    uint32_t setting1Addr = 0;

    CHECK_PARAM(IS_USB_VDMA_TARGET_FIFO_TYPE(fifoN));

    setting1Addr = USB_BASE + USB_VDMA_CXFPS1_OFFSET + 8 * (fifoN);

    return BL_GET_REG_BITS_VAL(BL_RD_WORD(setting1Addr), USB_VDMA_START_CXF) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  USB vdma multi channel function enable
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_VDMA_Enable(void)
{
    uint32_t tmpVal = 0;

    tmpVal = BL_RD_REG(USB_BASE, USB_VDMA_CTRL);
    tmpVal = BL_SET_REG_BIT(tmpVal, USB_VDMA_EN);
    BL_WR_REG(USB_BASE, USB_VDMA_CTRL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB LPM configuration
 *
 * @param  cfg: configuration
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_LPM_Config(USB_LPM_Cfg_Type *cfg)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_USB_LPM_RESP_TYPE(cfg->resp));

    tmpVal = BL_RD_REG(USB_BASE, USB_LPM_CAP);

    if (cfg->lpmWakeUpEn) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_LPM_WAKEUP_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_LPM_WAKEUP_EN);
    }

    BL_WR_REG(USB_BASE, USB_LPM_CAP, tmpVal);

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_LPM_ACCEPT, cfg->resp);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_LPM_BESL_MIN, cfg->minBesl);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_LPM_BESL_MAX, cfg->maxBesl);
    BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);

    if (cfg->lpmEn) {
        tmpVal = BL_SET_REG_BIT(tmpVal, USB_LPM_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, USB_LPM_EN);
    }

    BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  set USB LPM configuration
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
uint8_t USB_Get_LPM_BESL(void)
{
    return BL_GET_REG_BITS_VAL(BL_RD_REG(USB_BASE, USB_DEV_CTL), USB_LPM_BESL);
}

/****************************************************************************/ /**
 * @brief  set suspend delay
 *
 * @param  ms: delay ms count
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Set_Suspend_Delay(uint8_t ms)
{
    uint32_t tmpVal;

    CHECK_PARAM((ms <= 7));

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_ICR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_IDLE_CNT, ms);
    BL_WR_REG(USB_BASE, USB_DEV_ICR, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  USB group interrupt mask or unmask
 *
 * @param  intType: interrupt type
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Group_IntMask(USB_GRP_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_USB_GRP_INT_TYPE(intType));

    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_MIGR);

    if (intMask == MASK) {
        tmpVal = tmpVal | (1 << intType);
    } else {
        tmpVal = tmpVal & ~(1 << intType);
    }

    BL_WR_REG(USB_BASE, USB_DEV_MIGR, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get USB group interrupt status
 *
 * @param  intType: interrupt type
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type USB_Group_IntStatus(USB_GRP_INT_Type intType)
{
    CHECK_PARAM(IS_USB_GRP_INT_TYPE(intType));

    return (BL_RD_REG(USB_BASE, USB_DEV_IGR) & (1 << intType)) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  USB mask sub group interrupt
 *
 * @param  intType: interrupt type, USB_INT_CX_SETUP | USB_INT_CX_IN | ...
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type USB_Sub_Group_IntMask(uint64_t intType)
{
    uint64_t val = intType;
    uint32_t bit = 0;
    uint32_t tmpValG0 = BL_RD_WORD(USB_BASE + USB_DEV_MISG0_OFFSET);
    uint32_t tmpValG1 = BL_RD_WORD(USB_BASE + USB_DEV_MISG1_OFFSET);
    uint32_t tmpValG2 = BL_RD_WORD(USB_BASE + USB_DEV_MISG2_OFFSET);
    uint32_t tmpValG3 = BL_RD_WORD(USB_BASE + USB_DEV_MISG3_OFFSET);
    uint32_t tmpValG4 = BL_RD_WORD(USB_BASE + USB_DEV_MISG4_OFFSET);

